Ran Plan for project: `search-recommand-devops-apnortheast2-stg` dir: `env/stg/apne2/devops` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.ec2.aws_instance.ec2["search-atlantis-01"] will be updated in-place
~ resource "aws_instance" "ec2" {
        id                                   = "i-027902010ede8f3a6"
      ~ public_dns                           = "ec2-3-36-78-213.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.36.78.213" -> (known after apply)
        tags                                 = {
            "Name"      = "search-atlantis-01-stg"
            "createdBy" = "devops@example.com"
            "env"       = "stg"
            "managedBy" = "terraform-admin"
            "project"   = "search-recommand"
            "service"   = "search-recommand"
            "teamTag"   = "devops"
        }
      ~ user_data                            = "ab255655aee6f6a0edc7ae552b23ccf1da333460" -> "bd270f565b44b40afe5ff617f919edaa99ddc848"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.ec2.local_file.ec2_key_pair_local_file["search-atlantis-key"] will be created
+ resource "local_file" "ec2_key_pair_local_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "../../../../modules/aws/compute/ec2/keypair/search-atlantis-key.pem"
      + id                   = (known after apply)
    }

  # module.ec2.local_file.ec2_key_pair_local_file["search-opensearch-key"] will be created
+ resource "local_file" "ec2_key_pair_local_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "../../../../modules/aws/compute/ec2/keypair/search-opensearch-key.pem"
      + id                   = (known after apply)
    }

  # module.ecr.aws_ecr_repository.ecr_repository["search-elasticsearch-api"] will be created
+ resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "search-elasticsearch-api-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "search-elasticsearch-api-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "search-elasticsearch-api-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr.aws_ecr_repository.ecr_repository["search-opensearch-api"] will be created
+ resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "search-opensearch-api-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "search-opensearch-api-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "search-opensearch-api-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecs.aws_ecs_cluster.ecs_cluster["search-ecs-cluster"] will be created
+ resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "search-ecs-cluster-stg"
      + tags     = {
          + "Name"      = "search-ecs-cluster-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all = {
          + "Name"      = "search-ecs-cluster-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + setting (known after apply)
    }

  # module.ecs.aws_ecs_service.ecs_service["search-elasticsearch-ecs-service"] will be created
+ resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "search-ecs-cluster-stg"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 250
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "search-elasticsearch-ecs-service-stg"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"      = "search-elasticsearch-ecs-service-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-elasticsearch-ecs-service-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "search-elasticsearch-api-stg"
          + container_port   = 10092
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0c7c3b715f03da6f1",
            ]
          + subnets          = [
              + "subnet-03f24d570d0f4f5f5",
              + "subnet-060e8eb642b01575d",
              + "subnet-0d3c6a5b7f6d8ddde",
            ]
        }
    }

  # module.ecs.aws_ecs_service.ecs_service["search-opensearch-ecs-service"] will be created
+ resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "search-ecs-cluster-stg"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 250
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "search-opensearch-ecs-service-stg"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"      = "search-opensearch-ecs-service-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-opensearch-ecs-service-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "search-opensearch-api-stg"
          + container_port   = 10091
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0b88ab3e26ecab768",
            ]
          + subnets          = [
              + "subnet-03f24d570d0f4f5f5",
              + "subnet-060e8eb642b01575d",
              + "subnet-0d3c6a5b7f6d8ddde",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition["search-elasticsearch-api-td"] will be created
+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 512
                  + environment  = [
                      + {
                          + name  = "SPRING_PROFILES_ACTIVE"
                          + value = "stg"
                        },
                      + {
                          + name  = "TZ"
                          + value = "Asia/Seoul"
                        },
                    ]
                  + healthCheck  = {
                      + command  = [
                          + "CMD-SHELL",
                          + "curl --fail http://127.0.0.1:10092/health-check || exit 1",
                        ]
                      + interval = 30
                      + retries  = 3
                      + timeout  = 10
                    }
                  + image        = "842675972665.dkr.ecr.ap-northeast-2.amazonaws.com/search-elasticsearch-api-stg:1.0.0"
                  + memory       = 1024
                  + name         = "search-elasticsearch-api-stg"
                  + portMappings = [
                      + {
                          + containerPort = 10092
                          + hostPort      = 10092
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::842675972665:role/search-ecs-task-exec-role"
      + family                   = "search-elasticsearch-api-td-stg"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"      = "search-elasticsearch-api-td-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                 = {
          + "Name"      = "search-elasticsearch-api-td-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_role_arn            = "arn:aws:iam::842675972665:role/search-ecs-task-role"
      + track_latest             = false

      + ephemeral_storage {
          + size_in_gib = 21
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "search-elasticsearch-api-shared-volume"
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition["search-opensearch-api-td"] will be created
+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 512
                  + environment  = [
                      + {
                          + name  = "SPRING_PROFILES_ACTIVE"
                          + value = "stg"
                        },
                      + {
                          + name  = "TZ"
                          + value = "Asia/Seoul"
                        },
                    ]
                  + healthCheck  = {
                      + command  = [
                          + "CMD-SHELL",
                          + "curl --fail http://127.0.0.1:10091/health-check || exit 1",
                        ]
                      + interval = 30
                      + retries  = 3
                      + timeout  = 10
                    }
                  + image        = "842675972665.dkr.ecr.ap-northeast-2.amazonaws.com/search-opensearch-api-stg:1.0.0"
                  + memory       = 1024
                  + name         = "search-opensearch-api-stg"
                  + portMappings = [
                      + {
                          + containerPort = 10091
                          + hostPort      = 10091
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::842675972665:role/search-ecs-task-exec-role"
      + family                   = "search-opensearch-api-td-stg"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"      = "search-opensearch-api-td-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                 = {
          + "Name"      = "search-opensearch-api-td-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + task_role_arn            = "arn:aws:iam::842675972665:role/search-ecs-task-role"
      + track_latest             = false

      + ephemeral_storage {
          + size_in_gib = 21
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "search-opensearch-api-shared-volume"
            # (1 unchanged attribute hidden)
        }
    }

  # module.elb.aws_lb.alb["search-recommand-alb"] will be created
+ resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 300
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "search-recommand-alb-stg"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0a16a702aff6043e4",
        ]
      + subnets                                                      = [
          + "subnet-00e078cfd7c0a04f8",
          + "subnet-0966b1558bedae558",
          + "subnet-0b4354dcd2c1d4851",
        ]
      + tags                                                         = {
          + "Name"      = "search-recommand-alb-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                                                     = {
          + "Name"      = "search-recommand-alb-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.elb.aws_lb_listener.alb_listener["search-alb-http-listener"] will be created
+ resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"      = "search-alb-http-listener-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                                                              = {
          + "Name"      = "search-alb-http-listener-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["search-elasticsearch-alb-http-listener-rule"] will be created
+ resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 2
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/elasticsearch",
                ]
            }
        }
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["search-opensearch-alb-http-listener-rule"] will be created
+ resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/vector",
                ]
            }
        }
    }

  # module.elb.aws_lb_target_group.target_group["search-elasticsearch-alb-tg"] will be created
+ resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "search-elasticsearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10092
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "search-elasticsearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-elasticsearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-084ffd85a0c69a412"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10092"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.elb.aws_lb_target_group.target_group["search-opensearch-alb-tg"] will be created
+ resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "search-opensearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10091
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "search-opensearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-opensearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-084ffd85a0c69a412"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10091"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

Plan: 15 to add, 1 to change, 0 to destroy.

Changes to Outputs:
~ debug_ec2            = (sensitive value)
+ debug_ecr_module     = (sensitive value)
+ debug_ecs_module     = (sensitive value)
+ debug_iam_module     = (sensitive value)
+ debug_network_module = (sensitive value)
+ debug_storage_module = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p search-recommand-devops-apnortheast2-stg
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://7cd8d8250b96:4141/lock?id=DevOpsTechGroup%252Fsearch-recommand-terraform%252Fenv%252Fstg%252Fapne2%252Fdevops%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p search-recommand-devops-apnortheast2-stg
  ```
Plan: 15 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```